The rename() Method

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'age': [12.0, 13.0, 14.0, 16.0],
    'weight': [41.1, 34.5, 83.2, 90.1],
    'height': [1.72, 1.74, 1.91, 1.54]
})

In [3]:
df

    age  weight  height
0  12.0    41.1    1.72
1  13.0    34.5    1.74
2  14.0    83.2    1.91
3  16.0    90.1    1.54

In [4]:
df.rename(index={0 : 'Anup'})

       age  weight  height
Anup  12.0    41.1    1.72
1     13.0    34.5    1.74
2     14.0    83.2    1.91
3     16.0    90.1    1.54

In [5]:
df.rename(index={0 : 'Anup', 1 : 'Varun'})

        age  weight  height
Anup   12.0    41.1    1.72
Varun  13.0    34.5    1.74
2      14.0    83.2    1.91
3      16.0    90.1    1.54

In [7]:
df.rename(columns={'weight' : 'Weight (kg)'})

    age  Weight (kg)  height
0  12.0         41.1    1.72
1  13.0         34.5    1.74
2  14.0         83.2    1.91
3  16.0         90.1    1.54

In [10]:
df.rename(columns={'weight' : 'Weight (kg)'}, index={0: 'Anup'}, inplace=False)

       age  Weight (kg)  height
Anup  12.0         41.1    1.72
1     13.0         34.5    1.74
2     14.0         83.2    1.91
3     16.0         90.1    1.54

In [11]:
df

    age  weight  height
0  12.0    41.1    1.72
1  13.0    34.5    1.74
2  14.0    83.2    1.91
3  16.0    90.1    1.54

Alternative Approach

In [13]:
df.rename(mapper={'height' : 'Height (m)'}, axis=0)

    age  weight  height
0  12.0    41.1    1.72
1  13.0    34.5    1.74
2  14.0    83.2    1.91
3  16.0    90.1    1.54

In [14]:
df.rename(mapper={'height' : 'Height (m)'}, axis=1)

    age  weight  Height (m)
0  12.0    41.1        1.72
1  13.0    34.5        1.74
2  14.0    83.2        1.91
3  16.0    90.1        1.54

In [15]:
df.rename(mapper={'height' : 'Height (m)'}, axis='columns')

    age  weight  Height (m)
0  12.0    41.1        1.72
1  13.0    34.5        1.74
2  14.0    83.2        1.91
3  16.0    90.1        1.54

In [16]:
df.axes[1]

Index(['age', 'weight', 'height'], dtype='object')

In [17]:
df.axes[0]

RangeIndex(start=0, stop=4, step=1)